In [ ]:
# select the rows from brlow DF where marks are less than 60

In [1]:
import pandas as pd

In [10]:
data={
    "Name":["john","Roberi","Jonny","Mia"],
    "Marks":[90,92,10,20]
}

In [11]:
df=D=pd.DataFrame(data)
df

     Name  Marks
0    john     90
1  Roberi     92
2   Jonny     10
3     Mia     20

In [13]:
df['Marks']>30

0     True
1     True
2    False
3    False
Name: Marks, dtype: bool

In [14]:
filt=df.filter(df.Marks<30)
filt

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [ ]:
# 5 write a program to select the rows where the sales are higher than 60000 for mumbai

In [18]:
data1={
    "Store":["A","B","C","D"],
    "Location":["Mumbai","Pune","Hydrabad","Aurangabad"],
    "Sales":[4000,2000,1000,4500]
}
data2={
    "Store":["A","B","C","D"],
    "Location":["Delhi","Nagpur","Jalna","Ambad"],
    "Sales":[4800,2400,1500,2500]
}

df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
print(df1)
print()
print(df2)

  Store    Location  Sales
0     A      Mumbai   4000
1     B        Pune   2000
2     C    Hydrabad   1000
3     D  Aurangabad   4500

  Store Location  Sales
0     A    Delhi   4800
1     B   Nagpur   2400
2     C    Jalna   1500
3     D    Ambad   2500

In [20]:
pd.concat([df1,df2])

  Store    Location  Sales
0     A      Mumbai   4000
1     B        Pune   2000
2     C    Hydrabad   1000
3     D  Aurangabad   4500
0     A       Delhi   4800
1     B      Nagpur   2400
2     C       Jalna   1500
3     D       Ambad   2500

In [21]:
df5=pd.concat([df1,df2],ignore_index=True)

  Store    Location  Sales
0     A      Mumbai   4000
1     B        Pune   2000
2     C    Hydrabad   1000
3     D  Aurangabad   4500
4     A       Delhi   4800
5     B      Nagpur   2400
6     C       Jalna   1500
7     D       Ambad   2500